app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number") VALUES (?, ?)  [["title", "maths"], ["room_number", 45]]
---
    def create
        @class = SchoolClass.new(school_class_params(:first_name, :last_name))
        @class.save